package lesson11;

/* Легенда гласит, что где-то в Ханое находится храм, в котором размещена следующая конструкция:
 * на основании укреплены 3 алмазных стержня, на которые при сотворении мира Брахма нанизал 64 
 * золотых диска с отверстием посередине, причем внизу оказался самый большой диск, 
 * на нем – чуть меньший и так далее, пока на верхушке пирамиды не оказался самый маленький диск.
 * Жрецы храма обязаны перекладывать диски по следующим правилам:
 * 1. За один ход можно перенести только один диск.
 * 2. Нельзя класть больший диск на меньший.
 * Руководствуясь этими нехитрыми правилами, жрецы должны перенести исходную пирамиду с 1-го
 * стержня на 3-й. Как только они справятся с этим заданием, наступит конец света.
 * Мы предлагаем Вам в качестве домашнего задания - решить данную задачу с помощью рекурсии.
 */
import java.math.*;

public class Legenda {
	
	/* обчислення загальної кількості переміщень:
	 * 1)пірамідка з одного диску переміщується за один рух
	 * 2)для переміщення пірамідки з двома дисками потрібно три рухи - зняти верхній шар перемістити нижній
	 * диск і поставити верхній шар назад = 1+1+1
	 * 3)для переміщення пірамідки з трьома дисками потрібно зняти верхній шар (два диски = 3 рухи)
	 * перемістити нижній диск (1 рух) + поставити наверх верхній шар = ще 3 рухи  = 3+1+3 = 7
	 * 4) для переміщення пірамідки з 4 дисків = 7+1+7 = 15
	 * і т.д....
	 * тобто загальна формула N = N*2+1
	 * для обчислення рухів поміщаємо у цикл з 64 разів
	 */ 
	
	static void arrayMover() {
		
	}
	
	public static void main(String[] arg) {
		 BigInteger N = BigInteger.valueOf(1);
		 
		// BigInteger d = с.multiply(b.add(BigInteger.valueOf(2))); // d - с * (b + 2)
		 
		for (int i=1; i<=64; i++) {
			N = N.multiply(BigInteger.valueOf(2)); 
			N.add(BigInteger.valueOf(1));
		}  
		
		System.out.println("усіх переміщень = "+N);
		System.out.println("хвилин на всі переміщення = "+N.divide(BigInteger.valueOf(60)));
		System.out.println("годин на всі переміщення = "+N.divide(BigInteger.valueOf(3600)));
		System.out.println("днів на всі переміщення = "+N.divide(BigInteger.valueOf(3600*24)));
		System.out.println("років на всі переміщення = "+N.divide(BigInteger.valueOf(3600*24*365)));
		System.out.println("років на всі переміщення = "+N.divide(BigInteger.valueOf(3600*24*365)));
	}
}
